tutorial/rgb_overset/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

motionSolverLibs    (rigidBodyMeshMotion);

motionSolver       rigidBodyMotion;

rigidBodyMotionCoeffs
{
    report          on;

    solver
    {
        type Newmark;
        //gamma   0.1;    // Velocity integration coefficient
        //beta    0.1;    // Position integration coefficient
    }

    accelerationRelaxation 0.8;
    
    bodies
    {
        floatingObject
        {
            type            rigidBody;
            parent          root;
            mass            3.148;
            
            centreOfMass    (0 0 0);
            inertia         (0.015 0 0 0.015 0 0.021);
            // Transformation tensor and centre of rotation
            transform       (1 0 0 0 1 0 0 0 1) (0 0 -0.015);
            
            joint
            {
                type            composite;
                joints
                (
                    {
                        type Px;
                    }
                    {
                        type Pz;
                    }
                    {
                        type Ry;
                    }
                );
            }
            
            patches         (floatingObject);
            innerDistance   100.0;
            outerDistance   101.0;
        }
    }
    
    restraints
    {
        moodyR
        {
            type               moodyR;
            body               floatingObject;
            
            inputFile         "Mooring/boxWu_exPoint.m";
            refAttachmentPt
            (
                (-0.1      0.1    -0.062)
                (-0.1     -0.1    -0.062)
                ( 0.1      0.1    -0.062)
                ( 0.1     -0.1    -0.062)    
            );
        }
        
        /* Example mooring restraints as defined in libsixDoFMooring
           map3R || moodyR || moorDynR1 || moorDynR2
           
        moorDynR1
        {
            type               moorDynR1;
            body               floatingObject;
            refAttachmentPt
            (
                (-0.1      0.1    -0.062)
                (-0.1     -0.1    -0.062)
                ( 0.1      0.1    -0.062)
                ( 0.1     -0.1    -0.062)
            );
        }
        
        moorDynR2_pt
        {
            type               moorDynR2;
            body               floatingObject;
            couplingMode       "POINT"; // optional
            inputFile          "Mooring/lines_v2_point.txt";
            refAttachmentPt
            (
                (-0.1      0.1    -0.062)
                (-0.1     -0.1    -0.062)
                ( 0.1      0.1    -0.062)
                ( 0.1     -0.1    -0.062)  
            );
            writeMooringVTK    true;
            vtkPrefix          "mdv2_pt";
            vtkStartTime       0;
            outerCorrector     3;
        }

        moorDynR2_bd
        {
            type               moorDynR2;
            body               floatingObject;
            couplingMode       "BODY"; // optional
            inputFile          "Mooring/lines_v2_point.txt";
            bodies
            (
                floatingObject
            );
            writeMooringVTK    true;
            vtkPrefix         "mdv2_pt";
            vtkStartTime       0;
            outerCorrector     3;
        }

        map3R
        {
            type                map3R;
            body                floatingObject;
            inputFile           "Mooring/esflOWC_4lines.map";
            summaryFile         "Mooring/esflOWC_summary.map";
            writeMooringForces  true;
            outputFile          "Mooring/mapForces.map";
            waterDepth          0.5;

            refAttachmentPt
            (
                (-0.1      0.1    -0.062)
                (-0.1     -0.1    -0.062)
                ( 0.1      0.1    -0.062)
                ( 0.1     -0.1    -0.062)
            );
            
            writeMooringVTK        true;
            nNodes                 10;
            //nodesPerLine           (10 10 10 10);
        }
        */
    }

}

// ************************************************************************* //
